---
kind: method
id: M:Autodesk.Revit.DB.RenderingSettings.GetRenderingRegionOutline
source: html/aa9a0a5b-0b25-20a2-fb5a-2bd857e00627.htm
---
# Autodesk.Revit.DB.RenderingSettings.GetRenderingRegionOutline Method

Returns the outline of the rendering region.

## Syntax (C#)
```csharp
public Outline GetRenderingRegionOutline()
```

## Returns
The outline of the rendering region.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The RenderingSettings are not currently using region rendering.